Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.Arrowhead Property
 The arrowhead attributes of the dimension.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrowheadAttributes Arrowhead { get; set; }
Public Property Arrowhead As ArrowheadAttributes
	Get
	Set
Property Value
Type: ArrowheadAttributes
See Also
Reference
DimensionSetBaseAttributes Class
Tekla.Structures.Drawing Namespace